---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidLocationLineJustificationFailure
source: html/ff003973-2633-dcdd-7bfe-81ef1e30bd3d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidLocationLineJustificationFailure Property

Modify the location justification to a invalid value.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidLocationLineJustificationFailure { get; }
```